require("./../lib/Typedef");



/** @type {Operation[]} */
const ope20010724_0401 = [
	{ name: "東武東上線", "status": "運転見合わせ", "detail": "東武東上線は、昨日の隕石衝突の影響で、全区間で運転を見合わせています。運転再開見込は立っていません。", createdAt: "2001/07/24 04:01" },
	{ name: "山手線", "status": "運転見合わせ", "detail": "山手線は、昨日の隕石衝突の影響で、運転を見合わせています。運転再開見込は立っていません。", createdAt: "2001/07/24 04:01" },
];

/** @type {Operation[]} */
const ope20010724_1230 = [
	{ name: "東武東上線", "status": "運転再開", "detail": "東武東上線は、昨日の隕石衝突の影響で、運転を見合わせていましたが、１２時１０分頃に運転を再開し、上下線に大幅な遅れがでています。", createdAt: "2001/07/24 12:30" },
	{ name: "山手線", "status": "運転見合わせ", "detail": "山手線は、昨日の隕石衝突の影響で、運転を見合わせています。運転再開見込は立っていません。", createdAt: "2001/07/24 04:01" },
];

/** @type {Operation[]} */
const ope20010724_1400 = [
	{ name: "山手線", "status": "運転再開見込", "detail": "山手線は、昨日の隕石衝突の影響で、運転を見合わせています。運転再開は１５時００分頃を見込んでいます。", createdAt: "2001/07/24 13:50" },
	{ name: "東武東上線", "status": "運転見合わせ", "detail": "東武東上線は、１３時３８分頃、池袋―北池袋駅間で発生した人身事故の影響で、池袋―小川町駅間の運転を見合わせています。なお、振替輸送を行っています。", createdAt: "2001/07/24 13:45" },
];

/** @type {Operation[]} */
const ope20010724_1430 = [
	{ name: "山手線", "status": "運転再開", "detail": "山手線は、昨日の隕石衝突の関係で、運転を見合わせていましたが、１４時１８分頃に運転を再開し、上下線に大幅な遅れがでています。", createdAt: "2001/07/24 14:25" },
	{ name: "東武東上線", "status": "運転見合わせ", "detail": "東武東上線は、１３時３６分頃、池袋―北池袋駅間で発生した人身事故の影響で、現在も池袋―和光市駅間の運転を見合わせています。また、運転区間の一部列車に遅れが出ています。なお、振替輸送を行っています。", createdAt: "2001/07/24 14:10" },
];

/** @type {Operation[]} */
const ope20010724_2000 = [
	{ name: "東武東上線", "status": "遅延", "detail": "東武東上線は、池袋―北池袋駅間での人身事故の影響で、遅れと運休がでています。", createdAt: "2001/07/24 19:50" },
];